app/Controllers/Welcome.php

    public function index()
    {
        helper(['form', 'url']);
        $data = [];

        if ($this->request->getMethod() === 'POST' && $this->validate([
                'name'      => 'required',
                'lastname'  => 'required',
                'address'   => 'required',
                'cellphone' => 'required',
            ])) {
            // Handle file upload (if any)
            $picture = $this->request->getFile('picture');
            if ($picture->isValid() && ! $picture->hasMoved()) {
                $newName = $picture->getRandomName();
                $picture->move(ROOTPATH . 'assets/img/uploads', $newName);
                $data['picture'] = $newName;
            }

            // Display submitted data
            $data['name'] = $this->request->getPost('name');
            $data['lastname'] = $this->request->getPost('lastname');
            $data['address'] = $this->request->getPost('address');
            $data['cellphone'] = $this->request->getPost('cellphone');

            $model = new UserModel();
            $model->insert($data);
---
INSERT INTO `user` (`picture`, `name`, `lastname`, `address`, `cellphone`) VALUES ('1720733815_8ca7e202e323fc63559e.png', 'Nelson', 'Hernandez', 'Roosvelt 3917', '1134407763')